extension/src/InformationRegisters/мкпПравилаДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>мкпПравилаДоступа</Name>
			<Comment>Матрица объект × операция × поля для клиента интеграции.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.мкпКлиентыИнтеграции</v8:Type>
				</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>50</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбъекта</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>255</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>50</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Разрешено</Name>
				<Type>
					<v8:Type>xs:boolean</v8:Type>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Поля</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>1000</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

extension/src/InformationRegisters/мкпЖурналВызовов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>мкпЖурналВызовов</Name>
			<Comment>Кто, что, когда, сколько длилось.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>36</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Клиент</Name>
				<Type>
					<v8:Type>cfg:CatalogRef.мкпКлиентыИнтеграции</v8:Type>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>10</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>500</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОтвета</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>10</v8:Digits>
						<v8:FractionDigits>0</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДлительностьМс</Name>
				<Type>
					<v8:Type>xs:decimal</v8:Type>
					<v8:NumberQualifiers>
						<v8:Digits>10</v8:Digits>
						<v8:FractionDigits>0</v8:FractionDigits>
					</v8:NumberQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Момент</Name>
				<Type>
					<v8:Type>xs:dateTime</v8:Type>
					<v8:DateQualifiers>
						<v8:DateFractions>DateTime</v8:DateFractions>
					</v8:DateQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкиJSON</Name>
					<Comment>JSON-массив ссылок объектов, затронутых вызовом.</Comment>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>2000</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сессия</Name>
					<Comment>X-Session-Id вызова, если был.</Comment>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>64</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

extension/src/Catalogs/мкпКлиентыИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>мкпКлиентыИнтеграции</Name>
			<Comment>Приложения и агенты: хеш токена, скоупы, сопоставленный пользователь 1С.</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ХешТокена</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>64</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скоупы</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>500</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПользовательИБ</Name>
				<Type>
					<v8:Type>xs:string</v8:Type>
					<v8:StringQualifiers>
						<v8:Length>100</v8:Length>
					</v8:StringQualifiers>
				</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
				<Type>
					<v8:Type>xs:boolean</v8:Type>
				</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

extension/src/CommonModules/мкпБезопасность/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ЭтоСлужебныйОбъект(Имя) Экспорт

	Возврат СтрНачинаетсяС(Строка(Имя), "мкп");

КонецФункции

Функция КлиентПоЗапросу(Запрос) Экспорт

	Заголовок = Запрос.Заголовки.Получить("Authorization");
	Если Заголовок = Неопределено Тогда
		Заголовок = Запрос.Заголовки.Получить("authorization");
	КонецЕсли;
	Если Заголовок = Неопределено Или Не СтрНачинаетсяС(Заголовок, "Bearer ") Тогда
		Возврат Неопределено;
	КонецЕсли;
	Токен = СокрЛП(Сред(Заголовок, 8));
	Если ПустаяСтрока(Токен) Тогда
		Возврат Неопределено;
	КонецЕсли;
	Возврат КлиентПоХешу(мкпСериализация.ХешТокена(Токен));

КонецФункции

Функция ЕстьСкоуп(Клиент, НужныйСкоуп) Экспорт

	Если Клиент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Список = СтрРазделить(Строка(Клиент.Скоупы), ",", Ложь);
	Для Каждого Элемент Из Список Цикл
		Если СокрЛП(Элемент) = НужныйСкоуп Или СокрЛП(Элемент) = "*" Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;

КонецФункции

Функция Разрешено(Клиент, ВидОбъекта, ИмяОбъекта, Операция) Экспорт

	Если Клиент = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	Если ЭтоСлужебныйОбъект(ИмяОбъекта) Тогда
		Возврат Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Правила.Разрешено КАК Разрешено,
	|	Правила.Поля КАК Поля
	|ИЗ
	|	РегистрСведений.мкпПравилаДоступа КАК Правила
	|ГДЕ
	|	Правила.Клиент = &Клиент";
	Запрос.УстановитьПараметр("Клиент", Клиент);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Операция = "read";
	КонецЕсли;
	ЗапросТочный = Новый Запрос;
	ЗапросТочный.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Правила.Разрешено КАК Разрешено
	|ИЗ
	|	РегистрСведений.мкпПравилаДоступа КАК Правила
	|ГДЕ
	|	Правила.Клиент = &Клиент
	|	И Правила.ВидОбъекта = &Вид
	|	И Правила.ИмяОбъекта = &Имя
	|	И Правила.Операция = &Операция";
	ЗапросТочный.УстановитьПараметр("Клиент", Клиент);
	ЗапросТочный.УстановитьПараметр("Вид", ВидОбъекта);
	ЗапросТочный.УстановитьПараметр("Имя", ИмяОбъекта);
	ЗапросТочный.УстановитьПараметр("Операция", Операция);
	Выборка = ЗапросТочный.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Разрешено = Истина;
	КонецЕсли;
	Возврат Ложь;

КонецФункции

Процедура ЗаписатьВызов(Клиент, Метод, Путь, КодОтвета, ДлительностьМс) Экспорт

	Запись = РегистрыСведений.мкпЖурналВызовов.СоздатьМенеджерЗаписи();
	Запись.Идентификатор = Строка(Новый УникальныйИдентификатор);
	Запись.Клиент = Клиент;
	Запись.Метод = Метод;
	Запись.Путь = Путь;
	Запись.КодОтвета = КодОтвета;
	Запись.ДлительностьМс = ДлительностьМс;
	Запись.Момент = ТекущаяУниверсальнаяДата();
	Запись.Записать();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КлиентПоХешу(Хеш)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Клиенты.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.мкпКлиентыИнтеграции КАК Клиенты
	|ГДЕ
	|	Клиенты.ХешТокена = &Хеш
	|	И Клиенты.Активен
	|	И НЕ Клиенты.ПометкаУдаления";
	Запрос.УстановитьПараметр("Хеш", Хеш);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;

КонецФункции

#КонецОбласти
